app/Controllers/Books.php

    public function index()
    {
        $data = [
            'books' => $this->bookModel->findAll(),
        ];
---
SELECT *
FROM `books`

    public function show($id)
    {
        $book = $this->bookModel->find($id);
---
SELECT *
FROM `books`
WHERE `books`.`id` = '2'