app/Controllers/Home.php

    public function index(): string
    {
        $bookModel = new BookModel();
        $userModel = new UserModel();

        $data = [
            'title' => 'BookHub - Your Library Destination',
            'totalBooks' => $bookModel->countAll(),
            'totalUsers' => $userModel->where('role', 'user')->countAllResults(),
            'featuredBooks' => $bookModel->orderBy('created_at', 'DESC')->findAll(4),
---
SELECT COUNT(*) AS `numrows` FROM `books`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'
SELECT *
FROM `books`
ORDER BY `created_at` DESC
 LIMIT 4