app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'yasseryjjou@gmail.com'
 LIMIT 1
---
    public function findByEmail(string $email)
    {
        return $this->where('email', $email)->first();